Repository: zhangchi0104/agent-sessions
Catalog: apps/TokenStats/TokenStats/Localizable.xcstrings
Source language: en
Languages: de, fr, ja, ru, zh_hans

# settings.tokens.currency.summary.update_failed_without_cache
source: Update failed · no rates cached
de: Aktualisierung fehlgeschlagen · keine Kurse zwischengespeichert
fr: Échec de l’actualisation · aucun taux en cache
ja: 更新に失敗 · キャッシュ済みのレートなし
ru: Не удалось обновить · курсов в кэше нет
zh_hans: 更新失败 · 无缓存汇率

# settings.tokens.currency.summary.update_failed_with_cache
source: Update failed · last known rates retained
de: Aktualisierung fehlgeschlagen · letzte bekannte Kurse beibehalten
fr: Échec de l’actualisation · derniers taux connus conservés
ja: 更新に失敗 · 前回取得したレートを維持
ru: Не удалось обновить · сохранены последние известные курсы
zh_hans: 更新失败 · 已保留上次已知汇率

# settings.tokens.currency.summary.fallback
source: %@ unavailable · USD fallback
de: %@ nicht verfügbar · ersatzweise USD
fr: %@ indisponible · repli sur USD
ja: %@ は利用不可 · USD にフォールバック
ru: Валюта %@ недоступна · резервное значение в USD
zh_hans: %@ 不可用 · 回退为 USD

# settings.tokens.currency.summary.stale
source: Cached rate may be out of date
de: Zwischengespeicherter Kurs möglicherweise veraltet
fr: Le taux en cache est peut-être obsolète
ja: キャッシュされたレートは古い可能性があります
ru: Курс в кэше может быть устаревшим
zh_hans: 缓存汇率可能已过期

# settings.tokens.currency.summary.no_rates
source: No exchange rates cached
de: Keine Wechselkurse zwischengespeichert
fr: Aucun taux de change en cache
ja: キャッシュ済みの為替レートなし
ru: В кэше нет курсов валют
zh_hans: 无缓存汇率

# settings.tokens.currency.summary.up_to_date
source: Up to date · %@
de: Aktuell · %@
fr: À jour · %@
ja: 最新 · %@
ru: Актуально · %@
zh_hans: 已是最新 · %@

# settings.tokens.currency.preview.title
source: Preview
de: Vorschau
fr: Aperçu
ja: プレビュー
ru: Предпросмотр
zh_hans: 预览

# settings.tokens.currency.preview.not_converted
source: %@ — not converted
de: %@ — nicht umgerechnet
fr: %@ — non converti
ja: %@ — 未換算
ru: %@ — без конвертации
zh_hans: %@ — 未换算

# settings.tokens.currency.preview.no_conversion
source: %@ — no conversion
de: %@ — keine Umrechnung
fr: %@ — aucune conversion
ja: %@ — 換算なし
ru: %@ — конвертация не требуется
zh_hans: %@ — 无需换算

# settings.tokens.currency.preview.fallback.accessibility_label
source: No usable %1$@ exchange rate; %2$@ is shown without conversion
de: Kein verwendbarer %1$@-Wechselkurs; %2$@ wird ohne Umrechnung angezeigt
fr: Aucun taux de change %1$@ utilisable ; %2$@ est affiché sans conversion
ja: 使用可能な %1$@ の為替レートがないため、%2$@ を換算せずに表示します
ru: Нет доступного курса для валюты %1$@; %2$@ отображается без конвертации
zh_hans: 没有可用的 %1$@ 汇率；当前显示 %2$@ 且不进行换算

# settings.tokens.currency.preview.usd.accessibility_label
source: %@; no currency conversion is needed
de: %@; keine Währungsumrechnung erforderlich
fr: %@ ; aucune conversion de devise n’est nécessaire
ja: %@。通貨換算は不要です
ru: %@; конвертация валюты не требуется
zh_hans: %@；无需进行货币换算

# settings.tokens.currency.preview.converted.accessibility_label
source: %1$@ is approximately %2$@
de: %1$@ entspricht ungefähr %2$@
fr: %1$@ correspond approximativement à %2$@
ja: %1$@ は約 %2$@ です
ru: %1$@ — приблизительно %2$@
zh_hans: %1$@ 约合 %2$@

# settings.tokens.currency.picker.title
source: Display Currency
de: Anzeigewährung
fr: Devise d’affichage
ja: 表示通貨
ru: Валюта отображения
zh_hans: 显示货币

# settings.tokens.currency.picker.search.placeholder
source: Search currencies
de: Währungen suchen
fr: Rechercher des devises
ja: 通貨を検索
ru: Поиск валют
zh_hans: 搜索货币

# settings.tokens.currency.picker.search.clear.accessibility_label
source: Clear currency search
de: Währungssuche löschen
fr: Effacer la recherche de devises
ja: 通貨検索をクリア
ru: Очистить поиск валют
zh_hans: 清除货币搜索

# settings.tokens.currency.picker.close.button
source: Close
de: Schließen
fr: Fermer
ja: 閉じる
ru: Закрыть
zh_hans: 关闭

# settings.tokens.currency.picker.popular.section
source: Popular
de: Beliebt
fr: Populaires
ja: よく使う通貨
ru: Популярные
zh_hans: 热门货币

# settings.tokens.currency.picker.automatic.section
source: Automatic
de: Automatisch
fr: Automatique
ja: 自動
ru: Автоматически
zh_hans: 自动

# settings.tokens.currency.picker.no_rates.footer
source: No rates are cached yet. Close this list and choose Refresh rates to load the %@ currency table.
de: Es sind noch keine Kurse zwischengespeichert. Schließen Sie diese Liste und wählen Sie „Kurse aktualisieren“, um die %@-Währungstabelle zu laden.
fr: Aucun taux n’est encore en cache. Fermez cette liste, puis choisissez « Actualiser les taux » pour charger la table des devises de %@.
ja: レートはまだキャッシュされていません。この一覧を閉じて「レートを更新」を選び、%@ の通貨レート表を読み込んでください。
ru: В кэше пока нет курсов. Закройте этот список и выберите «Обновить курсы», чтобы загрузить таблицу курсов от %@.
zh_hans: 尚未缓存汇率。请关闭此列表并选择“刷新汇率”，以加载 %@ 货币表。

# settings.tokens.currency.picker.all_currencies.section
source: All Currencies
de: Alle Währungen
fr: Toutes les devises
ja: すべての通貨
ru: Все валюты
zh_hans: 所有货币

# settings.tokens.currency.picker.row.selected.accessibility_label
source: %1$@, %2$@, selected
de: %1$@, %2$@, ausgewählt
fr: %1$@, %2$@, sélectionnée
ja: %1$@、%2$@、選択済み
ru: %1$@, %2$@, выбрано
zh_hans: %1$@，%2$@，已选择

# settings.tokens.currency.provider.frankfurter.explanation
source: Broad daily reference-rate coverage from multiple public providers.
de: Breite Abdeckung täglicher Referenzkurse aus mehreren öffentlichen Quellen.
fr: Large couverture de taux de référence quotidiens provenant de plusieurs fournisseurs publics.
ja: 複数の公開プロバイダによる、幅広い通貨を対象とした日次参照レートです。
ru: Широкий охват ежедневных справочных курсов от нескольких общедоступных поставщиков.
zh_hans: 提供来自多个公共数据提供方的广泛每日参考汇率。

# settings.tokens.currency.provider.exchange_rate_api.explanation
source: A keyless daily USD table; attribution is required by the service.
de: Eine tägliche USD-Tabelle ohne API-Schlüssel; der Dienst verlangt eine Quellenangabe.
fr: Une table quotidienne basée sur l’USD, sans clé API ; le service exige une attribution.
ja: API キー不要の日次 USD レート表です。サービスの利用には帰属表示が必要です。
ru: Ежедневная таблица курсов относительно USD без ключа; сервис требует указания источника.
zh_hans: 提供无需密钥的每日 USD 汇率表；该服务要求标注来源。

# settings.tokens.currency.provider.ecb.explanation
source: Official EUR reference rates converted once into USD cross-rates; coverage is limited to currencies published for the latest ECB date.
de: Offizielle EUR-Referenzkurse, einmal in USD-Kreuzkurse umgerechnet; abgedeckt sind nur Währungen, die für den jüngsten EZB-Stichtag veröffentlicht wurden.
fr: Taux de référence officiels en EUR, convertis une seule fois en taux croisés basés sur l’USD ; seules les devises publiées pour la dernière date de la BCE sont couvertes.
ja: 欧州中央銀行の公式 EUR 参照レートを一度だけ USD クロスレートに換算します。対象は、ECB の最新レート日に公表された通貨に限られます。
ru: Официальные справочные курсы относительно EUR, однократно пересчитанные в кросс-курсы относительно USD; доступны только валюты, опубликованные ЕЦБ на последнюю дату.
zh_hans: 将官方 EUR 参考汇率一次换算为 USD 交叉汇率；仅覆盖欧洲中央银行在最新日期发布的货币。

# settings.tokens.currency.source.title
source: Exchange Rate Source
de: Wechselkursquelle
fr: Source des taux de change
ja: 為替レートの取得元
ru: Источник курсов валют
zh_hans: 汇率来源

# settings.tokens.currency.source.provider.picker
source: Provider
de: Anbieter
fr: Fournisseur
ja: プロバイダ
ru: Поставщик
zh_hans: 提供商

# settings.tokens.currency.source.documentation.label
source: Documentation
de: Dokumentation
ja: ドキュメント
ru: Документация
zh_hans: 文档

# settings.tokens.currency.source.documentation.link
source: Open API documentation
de: API-Dokumentation öffnen
fr: Ouvrir la documentation de l’API
ja: API ドキュメントを開く
ru: Открыть документацию API
zh_hans: 打开 API 文档

# settings.tokens.currency.source.endpoint.placeholder
source: Full HTTPS API URL
de: Vollständige HTTPS-API-URL
fr: URL complète de l’API HTTPS
ja: 完全な HTTPS API URL
ru: Полный URL API с HTTPS
zh_hans: 完整 HTTPS API URL

# settings.tokens.currency.source.endpoint.accessibility_label
source: Exchange-rate API endpoint
de: API-Endpunkt für Wechselkurse
fr: Point de terminaison de l’API de taux de change
ja: 為替レート API エンドポイント
ru: Конечная точка API курсов валют
zh_hans: 汇率 API 端点

# settings.tokens.currency.source.endpoint.credential_warning
source: Use a public, keyless endpoint compatible with this provider. Do not include credentials or API keys in the URL.
de: Verwenden Sie einen öffentlichen Endpunkt ohne API-Schlüssel, der mit diesem Anbieter kompatibel ist. Fügen Sie der URL keine Anmeldedaten oder API-Schlüssel hinzu.
fr: Utilisez un point de terminaison public, sans clé API et compatible avec ce fournisseur. N’ajoutez aucun identifiant ni aucune clé API dans l’URL.
ja: このプロバイダと互換性がある、公開された API キー不要のエンドポイントを使用してください。URL に認証情報や API キーを含めないでください。
ru: Используйте общедоступную конечную точку без ключа, совместимую с этим поставщиком. Не включайте учетные данные или ключи API в URL.
zh_hans: 请使用与此提供商兼容的公开、无需密钥的端点。请勿在 URL 中包含凭据或 API 密钥。

# settings.tokens.currency.source.restore_default.button
source: Restore Default
de: Standard wiederherstellen
fr: Rétablir la valeur par défaut
ja: デフォルトに戻す
ru: Восстановить значение по умолчанию
zh_hans: 恢复默认值

# settings.tokens.currency.source.https_endpoint.section
source: HTTPS endpoint
de: HTTPS-Endpunkt
fr: Point de terminaison HTTPS
ja: HTTPS エンドポイント
ru: Конечная точка HTTPS
zh_hans: HTTPS 端点

# settings.tokens.currency.source.endpoint.verification_footer
source: TokenStats verifies the endpoint before switching. It contacts only the selected endpoint and never fails over to another service.
de: TokenStats überprüft den Endpunkt vor dem Wechsel. Es kontaktiert nur den ausgewählten Endpunkt und wechselt bei Fehlern nie zu einem anderen Dienst.
fr: TokenStats vérifie le point de terminaison avant de basculer. Il contacte uniquement le point de terminaison sélectionné et ne bascule jamais vers un autre service en cas d’échec.
ja: TokenStats は切り替える前にエンドポイントを検証します。選択したエンドポイントにのみ接続し、別のサービスへ自動的にフェイルオーバーすることはありません。
ru: TokenStats проверяет конечную точку перед переключением. Приложение обращается только к выбранной конечной точке и никогда не переключается на другой сервис автоматически.
zh_hans: TokenStats 会在切换前验证端点。它只联系所选端点，绝不会自动故障转移到其他服务。

# settings.tokens.currency.source.validation_error.accessibility_label
source: Could not use rate provider. %@
de: Kursanbieter konnte nicht verwendet werden. %@
fr: Impossible d’utiliser le fournisseur de taux. %@
ja: レートプロバイダを使用できませんでした。%@
ru: Не удалось использовать поставщика курсов. %@
zh_hans: 无法使用汇率提供商。%@

# settings.tokens.currency.source.cancel.button
source: Cancel
de: Abbrechen
fr: Annuler
ja: キャンセル
ru: Отмена
zh_hans: 取消

# settings.tokens.currency.source.verifying
source: Verifying…
de: Überprüfung…
fr: Vérification…
ja: 検証中…
ru: Проверка…
zh_hans: 正在验证…

# settings.tokens.currency.source.verify_and_use.button
source: Verify & Use
de: Prüfen & verwenden
fr: Vérifier et utiliser
ja: 検証して使用
ru: Проверить и использовать
zh_hans: 验证并使用

# settings.tokens.currency.source.verifying.accessibility_label
source: Verifying exchange-rate source
de: Wechselkursquelle wird überprüft
fr: Vérification de la source des taux de change
ja: 為替レートの取得元を検証中です
ru: Проверка источника курсов валют
zh_hans: 正在验证汇率来源

# settings.tokens.currency.source.verify_and_use.accessibility_label
source: Verify and use exchange-rate source
de: Wechselkursquelle prüfen und verwenden
fr: Vérifier et utiliser la source des taux de change
ja: 為替レートの取得元を検証して使用します
ru: Проверить и использовать источник курсов валют
zh_hans: 验证并使用汇率来源

# tokens.agent.selected_total.accessibility
source: %2$@, %1$lld selected tokens
de: %2$@, %1$lld ausgewählte Token
fr: %2$@, %1$lld tokens sélectionnés
ja: %2$@、選択合計は%1$lldトークンです
ru: %2$@, выбрано %1$lld токена
zh_hans: %2$@，已选合计 %1$lld 个 Token

# tokens.agent.selected_total.help
source: %1$lld selected tokens of %2$@ total across all three kinds
de: %1$lld ausgewählte Token von insgesamt %2$@ über alle drei Typen
fr: %1$lld tokens sélectionnés sur un total de %2$@ pour les trois types
ja: 選択合計は%1$lldトークンです（3種類すべての合計：%2$@）
ru: Выбрано %1$lld токена; всего по всем трём типам: %2$@
zh_hans: 已选合计 %1$lld 个 Token；全部三种 Token 类型共 %2$@ 个 Token

# tokens.kind.cache_read
source: Cache read
de: Cache-Lesevorgang
fr: Lecture du cache
ja: キャッシュ読み取り
ru: Чтение кэша
zh_hans: 缓存读取

# tokens.kind.cache_read.abbreviation
source: C·R
de: C·L
fr: L·C
ja: 読込
ru: К·Ч
zh_hans: 缓·读

# tokens.kind.cache_read.action_form
source: cache read
de: Token aus Cache-Lesevorgängen
fr: lecture du cache
ja: キャッシュ読み取り
ru: чтение кэша
zh_hans: 缓存读取

# tokens.kind.cache_read.row_prefix
source: Cache read
de: Cache-Lesevorgänge
fr: Lecture du cache
ja: キャッシュ読み取り
ru: Чтение кэша
zh_hans: 缓存读取

# tokens.kind.direct_input
source: Direct input
de: Direkte Eingabe
fr: Entrée directe
ja: 直接入力
ru: Прямой ввод
zh_hans: 直接输入

# tokens.kind.direct_input.abbreviation
source: IN
de: EIN
fr: ENT
ja: 入力
ru: ВХ
zh_hans: 输入

# tokens.kind.direct_input.action_form
source: direct input
de: Token aus direkten Eingaben
fr: entrée directe
ja: 直接入力
ru: прямой ввод
zh_hans: 直接输入

# tokens.kind.direct_input.row_prefix
source: Direct input
de: Direkte Eingabe
fr: Entrée directe
ja: 直接入力
ru: Прямой ввод
zh_hans: 直接输入

# tokens.kind.exclude.help
source: Exclude %@ from the selected total
de: %@ aus der ausgewählten Summe ausschließen
fr: Exclure les tokens du type « %@ » du total sélectionné
ja: 選択合計からトークン種別「%@」を除外
ru: Не учитывать %@ в итоге по выбранным типам
zh_hans: 从已选合计中排除%@

# tokens.kind.include.accessibility
source: Include %@ tokens
de: %@ einbeziehen
fr: Inclure les tokens du type « %@ »
ja: トークン種別「%@」を含める
ru: Учитывать токены типа «%@»
zh_hans: 在已选合计中包含%@

# tokens.kind.include.help
source: Include %@ in the selected total
de: %@ in die ausgewählte Summe einbeziehen
fr: Inclure les tokens du type « %@ » dans le total sélectionné
ja: 選択合計にトークン種別「%@」を含める
ru: Учитывать %@ в итоге по выбранным типам
zh_hans: 在已选合计中包含%@

# tokens.kind.output
source: Output
de: Ausgabe
fr: Sortie
ja: 出力
ru: Вывод
zh_hans: 输出

# tokens.kind.output.abbreviation
source: OUT
de: AUS
fr: SORT
ja: 出力
ru: ВЫХ
zh_hans: 输出

# tokens.kind.output.action_form
source: output
de: Ausgabe-Token
fr: sortie
ja: 出力
ru: вывод
zh_hans: 输出

# tokens.kind.output.row_prefix
source: Output
de: Ausgabe
fr: Sortie
ja: 出力
ru: Вывод
zh_hans: 输出

# tokens.model.unattributed
source: Unknown
de: Unbekannt
fr: Inconnu
ja: 不明
ru: Неизвестная модель
zh_hans: 未知

# tokens.range.picker.accessibility
source: Token Odometer range
de: Zeitraum des Token-Zählers
fr: Période du compteur de tokens
ja: トークン積算計の期間
ru: Диапазон счётчика токенов
zh_hans: Token 计量范围

# tokens.range.picker.title
source: Range
de: Zeitraum
fr: Période
ja: 期間
ru: Диапазон
zh_hans: 范围

# tokens.range.seven_days
source: 7 days
de: 7 Tage
fr: 7 jours
ja: 7日間
ru: 7 дней
zh_hans: 7 天

# tokens.range.seven_days.heading_form
source: 7 days
de: 7 Tage
fr: 7 jours
ja: 7日間
ru: 7 дней
zh_hans: 7 天

# tokens.range.seven_days.sentence_form
source: 7 days
de: die letzten 7 Tage
fr: les 7 derniers jours
ja: 7日間
ru: 7 дней
zh_hans: 7 天

# tokens.range.thirty_days
source: 30 days
de: 30 Tage
fr: 30 jours
ja: 30日間
ru: 30 дней
zh_hans: 30 天

# tokens.range.thirty_days.heading_form
source: 30 days
de: 30 Tage
fr: 30 jours
ja: 30日間
ru: 30 дней
zh_hans: 30 天

# tokens.range.thirty_days.sentence_form
source: 30 days
de: die letzten 30 Tage
fr: les 30 derniers jours
ja: 30日間
ru: 30 дней
zh_hans: 30 天

# tokens.range.today
source: Today
de: Heute
fr: Aujourd’hui
ja: 今日
ru: Сегодня
zh_hans: 今天

# tokens.range.today.heading_form
source: Today
de: Heute
fr: Aujourd’hui
ja: 今日
ru: Сегодня
zh_hans: 今天

# tokens.range.today.sentence_form
source: today
de: heute
fr: aujourd’hui
ja: 今日
ru: сегодня
zh_hans: 今天

# tokens.row.kind.excluded
source: %1$@ %2$@; excluded from composition percentages
de: %1$@ %2$@; bei den prozentualen Anteilen nicht berücksichtigt
fr: %1$@ %2$@ ; hors des pourcentages de composition
ja: %1$@：%2$@（構成比から除外）
ru: %1$@: %2$@; не учитывается при расчёте процентного состава
zh_hans: %1$@ %2$@；已从构成百分比中排除

# tokens.row.kind.selected
source: %1$@ %2$@ (%3$@ of selected kinds)
de: %1$@ %2$@ (%3$@ der ausgewählten Typen)
fr: %1$@ %2$@ (%3$@ du total sélectionné)
ja: %1$@：%2$@（選択した種別に占める割合：%3$@）
ru: %1$@: %2$@ (%3$@ от итога по выбранным типам)
zh_hans: %1$@ %2$@（占所选类型的 %3$@）

# tokens.summary.api_equivalent.accessibility
source: %1$@ estimated API-equivalent usage for %2$@. Original USD estimate %3$@.
de: Geschätztes API-Äquivalent von %1$@ für %2$@. Ursprüngliche USD-Schätzung: %3$@.
fr: Estimation de l’équivalent API de %1$@ pour %2$@. Estimation d’origine en USD : %3$@.
ja: %2$@の API 換算額（推定）は%1$@です。元の USD 推定額は%3$@です。
ru: %1$@ — оценка эквивалента API за %2$@. Исходная оценка в USD: %3$@.
zh_hans: %1$@，%2$@的 API 等值费用估算。原始 USD 估算为 %3$@。

# tokens.summary.api_equivalent.empty.accessibility
source: No API-equivalent usage for %@
de: Kein API-Äquivalent für %@
fr: Aucun équivalent API pour %@
ja: %@の API 換算額はありません
ru: За %@ нет использования, для которого можно рассчитать эквивалент API
zh_hans: 所选范围（%@）内没有 API 等值费用

# tokens.summary.api_equivalent.empty.help
source: No API-equivalent usage for %@.
de: Kein API-Äquivalent für %@.
fr: Aucun équivalent API pour %@.
ja: %@の API 換算額はありません。
ru: За %@ нет использования, для которого можно рассчитать эквивалент API.
zh_hans: 所选范围（%@）内没有 API 等值费用。

# tokens.summary.api_equivalent.exact.help
source: Displayed estimate %1$@. Original USD estimate %2$@. %3$@
de: Angezeigte Schätzung: %1$@. Ursprüngliche USD-Schätzung: %2$@. %3$@
fr: Estimation affichée : %1$@. Estimation d’origine en USD : %2$@. %3$@
ja: 表示推定額：%1$@。元の USD 推定額：%2$@。%3$@
ru: Отображаемая оценка: %1$@. Исходная оценка в USD: %2$@. %3$@
zh_hans: 显示的估算为 %1$@。原始 USD 估算为 %2$@。%3$@

# tokens.summary.api_equivalent.help
source: Standard API-equivalent estimate by recorded Model; includes all three Token Kinds at list rates regardless of the display filters. The exact USD aggregate is converted first, then the displayed total is rounded upward once at the target currency's minor unit. Prices reviewed %@.
de: Standardmäßige Schätzung des API-Äquivalents anhand des aufgezeichneten Modells; umfasst unabhängig von den Anzeigefiltern alle drei Token-Typen zu Listenpreisen. Der exakte USD-Gesamtbetrag wird zuerst umgerechnet; anschließend wird der angezeigte Gesamtbetrag einmal auf die kleinste Einheit der Zielwährung aufgerundet. Preise geprüft am %@.
fr: Estimation standard de l’équivalent API d’après le modèle enregistré ; inclut les trois types de token aux tarifs publics, quels que soient les filtres d’affichage. Le total exact en USD est d’abord converti, puis le total affiché est arrondi une seule fois à la hausse selon l’unité mineure de la devise cible. Tarifs vérifiés le %@.
ja: 記録されたモデルに基づく標準 API 換算額の推定です。表示フィルタにかかわらず、3種類すべてのトークンを定価で含めます。正確な USD 合計を先に換算し、その後、表示する合計を換算先通貨の最小単位で一度だけ切り上げます。価格確認日：%@。
ru: Стандартная оценка эквивалента API по модели, указанной в журнале; включает все три типа токенов по публичным тарифам независимо от фильтров отображения. Сначала пересчитывается точная сумма в USD, затем отображаемая итоговая сумма один раз округляется вверх до минимальной единицы целевой валюты. Цены проверены %@.
zh_hans: 根据记录的模型，按标准公开价格估算 API 等值费用；无论显示筛选如何，均包含全部三种 Token 类型。先换算精确的 USD 合计，再按目标货币的最小单位将显示总额向上取整一次。价格审核日期：%@。

# tokens.summary.api_equivalent.label
source: API-equivalent · %1$@ · %2$@
de: API-Äquivalent · %1$@ · %2$@
fr: Équivalent API · %1$@ · %2$@
ja: API 換算額 · %1$@ · %2$@
ru: Эквивалент API · %1$@ · %2$@
zh_hans: API 等值费用 · %1$@ · %2$@

# tokens.summary.api_equivalent.partial.help
source: Standard API-equivalent estimate by recorded Model; includes all three Token Kinds at list rates regardless of the display filters. The exact USD aggregate is converted first, then the displayed total is rounded upward once at the target currency's minor unit. Prices reviewed %2$@. Unpriced Models: %3$@ (%1$lld tokens).
de: Standardmäßige Schätzung des API-Äquivalents anhand des aufgezeichneten Modells; umfasst unabhängig von den Anzeigefiltern alle drei Token-Typen zu Listenpreisen. Der exakte USD-Gesamtbetrag wird zuerst umgerechnet; anschließend wird der angezeigte Gesamtbetrag einmal auf die kleinste Einheit der Zielwährung aufgerundet. Preise geprüft am %2$@. Modelle ohne Preis: %3$@ (%1$lld Token).
fr: Estimation standard de l’équivalent API d’après le modèle enregistré ; inclut les trois types de token aux tarifs publics, quels que soient les filtres d’affichage. Le total exact en USD est d’abord converti, puis le total affiché est arrondi une seule fois à la hausse selon l’unité mineure de la devise cible. Tarifs vérifiés le %2$@. Modèles sans tarif : %3$@ (%1$lld tokens).
ja: 記録されたモデルに基づく標準 API 換算額の推定です。表示フィルタにかかわらず、3種類すべてのトークンを定価で含めます。正確な USD 合計を先に換算し、その後、表示する合計を換算先通貨の最小単位で一度だけ切り上げます。価格確認日：%2$@。価格情報のないモデル：%3$@（%1$lldトークン）。
ru: Стандартная оценка эквивалента API по модели, указанной в журнале; включает все три типа токенов по публичным тарифам независимо от фильтров отображения. Сначала пересчитывается точная сумма в USD, затем отображаемая итоговая сумма один раз округляется вверх до минимальной единицы целевой валюты. Цены проверены %2$@. Модели без цены: %3$@ (%1$lld токена).
zh_hans: 根据记录的模型，按标准公开价格估算 API 等值费用；无论显示筛选如何，均包含全部三种 Token 类型。先换算精确的 USD 合计，再按目标货币的最小单位将显示总额向上取整一次。价格审核日期：%2$@。未定价模型：%3$@（%1$lld 个 Token）。

# tokens.summary.api_equivalent.currency.fallback.label
source: %@ fallback
de: Ersatzweise %@
fr: Repli sur %@
ja: %@ にフォールバック
ru: Резервная валюта: %@
zh_hans: %@ 回退

# tokens.summary.api_equivalent.currency.fallback.last_fetched
source: Last rate table fetched: %@.
de: Letzte Kurstabelle abgerufen: %@.
fr: Dernière table de taux récupérée : %@.
ja: 前回のレート表取得日時：%@。
ru: Последнее получение таблицы курсов: %@.
zh_hans: 上次获取汇率表的时间：%@。

# tokens.summary.api_equivalent.currency.fallback.no_rate
source: No usable %@ exchange rate was available.
de: Es war kein verwendbarer %@-Wechselkurs verfügbar.
fr: Aucun taux de change %@ utilisable n’était disponible.
ja: 使用可能な %@ の為替レートがありませんでした。
ru: Доступный курс для валюты %@ не найден.
zh_hans: 没有可用的 %@ 汇率。

# tokens.summary.api_equivalent.currency.fallback.original_usd
source: No FX conversion was applied; showing the original USD estimate.
de: Es wurde keine Devisenumrechnung vorgenommen; die ursprüngliche USD-Schätzung wird angezeigt.
fr: Aucune conversion de devise n’a été appliquée ; l’estimation d’origine en USD est affichée.
ja: 為替換算は適用されていません。元の USD 推定額を表示しています。
ru: Конвертация валюты не применялась; отображается исходная оценка в USD.
zh_hans: 未进行汇率换算；当前显示原始 USD 估算。

# tokens.summary.api_equivalent.currency.fetch_unavailable
source: Fetch time unavailable.
de: Abrufzeit nicht verfügbar.
fr: Heure de récupération indisponible.
ja: 取得日時を確認できません。
ru: Время получения недоступно.
zh_hans: 获取时间不可用。

# tokens.summary.api_equivalent.currency.fetched
source: Fetched: %@.
de: Abgerufen: %@.
fr: Récupération : %@.
ja: 取得日時：%@。
ru: Получено: %@.
zh_hans: 获取时间：%@。

# tokens.summary.api_equivalent.currency.rate
source: Exchange rate: 1 USD = %1$@ %2$@.
de: Wechselkurs: 1 USD = %1$@ %2$@.
fr: Taux de change : 1 USD = %1$@ %2$@.
ja: 為替レート：1 USD = %1$@ %2$@。
ru: Курс валют: 1 USD = %1$@ %2$@.
zh_hans: 汇率：1 USD = %1$@ %2$@。

# tokens.summary.api_equivalent.currency.rate_date
source: Rate date: %@.
de: Kursdatum: %@.
fr: Date du taux : %@.
ja: レート日：%@。
ru: Дата курса: %@.
zh_hans: 报价日期：%@。

# tokens.summary.api_equivalent.currency.rate_date_unavailable
source: Rate date unavailable.
de: Kursdatum nicht verfügbar.
fr: Date du taux indisponible.
ja: レート日を確認できません。
ru: Дата курса недоступна.
zh_hans: 报价日期不可用。

# tokens.summary.api_equivalent.currency.status.current
source: Rate status: current.
de: Kursstatus: aktuell.
fr: État du taux : actuel.
ja: レートの状態：最新です。
ru: Статус курса: актуальный.
zh_hans: 汇率状态：当前。
